bryamzxz/tinylink/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# Copyright (c) 2026 Bryam (bryamzxz)
#
# tinylink default sdkconfig — common to all ESP32 variants.
# Per-target overrides live in sdkconfig.defaults.<target>.
#
# Hardening + tuning baseline for ESP-IDF v5.5.x.

# ---- Target / flash / partition table ----------------------------------------
# partitions.csv places ota_1 at 0x320000 + a 0x4000 nvs_creds region, so flash
# must be ≥ 4 MB (ESP32-WROOM-32E and friends ship with 4 MB).
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---- WiFi tuning (single-STA, low memory) ------------------------------------
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# ---- Power management --------------------------------------------------------
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# ---- mbedTLS minimal config (TLS + crypto for ts2021/DERP) -------------------
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
# Heap budget for two simultaneous TLS conns (long-poll + DERP
# supervisor). Pinning rationale, item-by-item:
#
# 1. DYNAMIC_BUFFER=y + SESSION_TICKETS=n. Verified on-device 2026-05-06.
#
# History: PR #20 (512f772) experimented with DYNAMIC_BUFFER=y and a
# 2026-05-02 incident reported mid-write heap corruption, after which
# the flag was reverted. The followup notes attributed it ambiguously
# to either DYNAMIC_BUFFER itself or the (DYNAMIC_BUFFER + tickets)
# combination plus IDF bug PR #14614 / IDFGH-13752 (heap corruption
# when DYNAMIC_BUFFER + IN_CONTENT_LEN<16384) and #15984 (TLS 1.3
# panics with DYNAMIC_BUFFER on).
#
# This sprint isolated the variables: DYNAMIC_BUFFER=y with
# SESSION_TICKETS=n through 5+ minutes of steady-state long-poll
# (full handshake on every reconnect, no ticket resumption) plus
# 70+ telemetry tx in a row, zero corruption, zero alloc fails,
# zero stream ends. IN_CONTENT_LEN stays at 16384 so #14614 does
# not apply. #15984 was historically a TLS 1.3 panic on connect;
# our tinylink-→Tailscale TLS path negotiates 1.3 and connects
# cleanly here, so either the IDF fix landed in v5.5.4 or our
# ciphersuite/extension set sidesteps the trigger.
#
# Heap effect: at supervisor-connect time (post-bringup, post-WG)
# largest_block went from 7.4 KiB → 11.8 KiB (+4.4 KiB). Still
# below the 12 KiB peak mbedtls cert verify needs for the second
# TLS conn, so SUPERVISED=y still doesn't connect on first try
# without further work — that's a separate PR (supervisor task
# restructure to retry until heap allows).
#
# Trade-off vs SESSION_TICKETS=y: each long-poll reconnect now does
# a full TLS handshake (cert chain verify, RSA signature) instead
# of resuming via NewSessionTicket. ~10 KiB transient peak instead
# of ~4 KiB transient peak. Acceptable because the steady-state
# heap budget freed by DYNAMIC_BUFFER=y outweighs the per-reconnect
# cost on this ESP32-WROOM-32E target.
#
# 2. IN_CONTENT_LEN stays at 16384. Go's crypto/tls (what
#    controlplane.tailscale.com runs) emits TLS records up to 16384
#    plaintext regardless of the application layer's frame sizes.
#    Lowering IN below 16384 would surface as record_overflow alerts
#    on a large keepalive or the first MapResponse. Also keeps us
#    out of IDF bug PR #14614 / IDFGH-13752 (heap corruption when
#    DYNAMIC_BUFFER + IN_CONTENT_LEN<16384).
# 3. OUT_CONTENT_LEN at 2048 (down from 4096). tinylink emits short
#    frames in both directions: MapRequest ~500 B-2 KiB, DERP
#    frames <1500 B WG packets. Saves 2 KiB per conn × 2 conns.
# 4. KEEP_PEER_CERTIFICATE off. Saves ~2 KiB per conn; we don't
#    introspect certs after verify.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=n

# ---- lwIP tunings ------------------------------------------------------------
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=n
CONFIG_LWIP_TCP_SACK_OUT=n
CONFIG_LWIP_TCP_MSS=1440

# PPP netstack used by tinylink_wg's lwIP integration (wg_lwip.c) for
# the point-to-point WG tunnel netif. We don't actually run PPP — we
# need ESP_NETIF_NETSTACK_DEFAULT_PPP as the base netstack template
# (raw IP, no link layer, no DHCP triggers). Enabling PPP costs ~10
# KiB flash; turning it on lets esp_netif register our custom netif
# without the DHCP-callback collision that killed trombik on IDF v5.5.
CONFIG_LWIP_PPP_SUPPORT=y

# ---- NVS encryption ----------------------------------------------------------
CONFIG_NVS_ENCRYPTION=y

# ---- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# ---- FreeRTOS ----------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ---- TLS to control plane ----------------------------------------------------
# tinylink talks ts2021 over TLS to controlplane.tailscale.com. We use
# esp_tls on top of mbedtls and verify against the IDF certificate bundle.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_ESP_TLS_USE_SECURE_ELEMENT=n
CONFIG_ESP_TLS_INSECURE=n
CONFIG_MBEDTLS_POLY1305_C=y

# ---- App task stacks ---------------------------------------------------------
# Bigger main stack: TLS + Noise IK + JSON construction is much heavier than
# the M1-WG bringup that this replaces. Verified on-device 2026-05-02:
# the boot-time mbedtls cert-chain verification + ECDSA + Noise IK init
# in tinylink_register peaks at ~14 KiB; bumped from 16 K to 24 K to give
# margin. The long-poll task in tinylink.c::tinylink_long_poll_start
# also xTaskCreate's at 24 KiB to absorb the same workload — bug from
# 8 K manifested as random LoadProhibited / Double exception / fake
# heap-corruption asserts.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576

# esp_timer dispatch task stack. mbedtls / lwIP timer callbacks (e.g.
# session ticket lifetime, sntp, peer-cert cleanup) routed through here
# blow past the 3584-byte default once TLS to controlplane.tailscale.com
# is up. Observed on first HW boot 2026-05-02: panic with EXCCAUSE 0x1c
# (LoadStoreError) immediately after the control-key fetch path,
# classic stack-overflow corruption. 6144 gives ~2x headroom.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
